app/controllers/foranias_controller.rb

SELECT * FROM "foranias" WHERE ("foranias"."id" = 1)
---
  def show
    @forania = Forania.find(params[:id])