app/controllers/missionarios_controller.rb

SELECT * FROM "paroquias" WHERE ("paroquias"."id" = 222)
---
  def index
    ordering
    set_conditions
    @missionarios = Missionario.find(:all, :include => :paroquia, :order => @ordering, :conditions => @conditions )

SELECT * FROM "missionarios" WHERE ("missionarios"."id" = 1)
---
  def show
    @missionario = Missionario.find(params[:id])

SELECT * FROM "missionarios" WHERE ("missionarios"."id" = 2)
---
  def edit
    @missionario = Missionario.find(params[:id])

INSERT INTO "missionarios" ("endereco", "created_at", "estado_id", "nome", "cep", "updated_at", "nascimento", "paroquia_id", "bairro", "cidade", "estado_civil", "movimentos_pastorais", "email", "profissao") VALUES('R. Alberto de Salvo, 112 fd', '2009-05-19 19:04:02', 1, 'Luís Guilherme', '13084-759', '2009-05-19 19:04:02', '1983-02-07', 222, 'Jd. Santa Genebra II', 'Campinas', 'Solteiro', 'Comunidade católicos do orkut
---
  def create
    @missionario = Missionario.new(params[:missionario])
    return unless access_control

    #if @missionario.cargo.nivel < @nivelmin
    #  flash[:notice] = 'Cargo não foi alterado.'
    #  @missionario.cargo = Cargo.find_by_nivel(5)
    #end

    respond_to do |format|

      if @missionario.save

SELECT * FROM "missionarios" WHERE ("missionarios"."id" = 3)
---
  def update
    flash[:notice] = ''
    params[:missionario][:sacramento_ids] ||= []
    params[:missionario][:existe_telefone_attributes] ||= { }

    @missionario = Missionario.find(params[:id])

SELECT * FROM "missionarios" WHERE ("missionarios"."id" = 1)
DELETE FROM "missionarios" WHERE "id" = 1
---
  def destroy
    @missionario = Missionario.find(params[:id])
    unless @user.nivel <= 1
      flash[:notice] = 'Acesso negado'
      redirect_to(missionarios_url)
      return
    end
    @missionario.destroy

SELECT * FROM "paroquias"
---
  def set_conditions
    @conditions = { }
    if params[:paroquia_id]
      @conditions[:paroquia_id] = params[:paroquia_id]
    elsif params[:forania_id]
      forania = Forania.find(params[:forania_id])
      @conditions[:paroquia_id] = forania.paroquias.map { |p| p.id }