app/controllers/paroquias_controller.rb

  def show
    @paroquia = Paroquia.find(params[:id])
---
SELECT * FROM "paroquias" WHERE ("paroquias"."id" = 1)

  def edit
    @paroquia = Paroquia.find(params[:id])
---
SELECT * FROM "paroquias" WHERE ("paroquias"."id" = 1)

  def update
    @paroquia = Paroquia.find(params[:id])
---
SELECT * FROM "paroquias" WHERE ("paroquias"."id" = 1)