app/controllers/vicariatos_controller.rb

SELECT * FROM "vicariatos" WHERE ("vicariatos"."id" = 1)
---
  def show
    @vicariato = Vicariato.find(params[:id])

SELECT * FROM "vicariatos" WHERE ("vicariatos"."id" = 3)
---
  def edit
    @vicariato = Vicariato.find(params[:id])

INSERT INTO "vicariatos" ("created_at", "nome", "updated_at") VALUES('2009-04-24 00:05:34', 'Urbano', '2009-04-24 00:05:34')
---
  def create
    @vicariato = Vicariato.new(params[:vicariato])

    respond_to do |format|
      if @vicariato.save

SELECT * FROM "vicariatos" WHERE ("vicariatos"."id" = 3)
UPDATE "vicariatos" SET "updated_at" = '2009-04-24 00:46:09', "nome" = 'Jacarepaguá' WHERE "id" = 3
---
  def update
    @vicariato = Vicariato.find(params[:id])

    respond_to do |format|
      if @vicariato.update_attributes(params[:vicariato])

SELECT * FROM "vicariatos" WHERE ("vicariatos"."id" = 2)
DELETE FROM "vicariatos" WHERE "id" = 2
---
  def destroy
    @vicariato = Vicariato.find(params[:id])
    @vicariato.destroy